// Задача 21
//Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 3D пространстве.
//A (3,6,8); B (2,1,-7), -> 15.84
//A (7,-5, 0); B (1,-1,9) -> 11.53

Console.WriteLine("Введите координату первой точки по 'X'");
int x1 = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Введите координату первой точки по 'Y'");
int y1 = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Введите координату первой точки по 'Z'");
int z1 = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Введите координату первой точки по 'X'");
int x1 = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Введите координату первой точки по 'Y'");
int y2 = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Введите координату первой точки по 'Z'");
int z2 = Convert.ToInt32(Console.ReadLine());
console.WriteLine("Координаты точки А""")
double result = 
